0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 0 0 1 0 0 0 ];

internalField   uniform 1;

boundaryField
{    
    cylinder
    {
        type            zeroGradient;
    }
    backside
    {
        type            empty;
    }
    inflow
    {
        type            inletOutlet;
        inletValue	uniform 1;
    }
    outflow
    {
        type            zeroGradient;
    }
    upflow
    {
        type            symmetry;
    }
    downflow
    {
        type            symmetry;
    }
    frontside
    {
        type            empty;
    }
}



// ************************************************************************* //
